var data = [];
var dataStr = '1、摔跤吧爸爸<br>\
<br>\
·这个世界充满假象，<br>\
·唯有痛楚从不说谎。<br>\
·如果你获得了银牌，你会被遗忘。 如果赢得了金牌，你会成为典范。<br>\
·不要忘记，你是怎么一步步走到今天的。<br>\
·你在此处停留是为了成为最强者。<br>\
<br>\
<br>\
2、变形金刚5<br>\
<br>\
·这始于一个传说，最伟大的传说之一。<br>\
·我们把它隐藏了千年，现在要拯救我们的未来，就必须揭开过去。<br>\
·两个世界相撞，只能幸存其一。<br>\
·擎天柱，你毁掉了自己的家园，你想赎罪？<br>\
·是的，我的创造者。<br>\
·好好刷牙，努力工作，离搞乐队的男孩远点儿，尤其是鼓手。 <br>\
<br>\
<br>\
3、神偷奶爸3<br>\
<br>\
·我现在是一个父亲 一个守法的商人。<br>\
·我享受整个过程的每一秒钟 说实话 我都快high起来了!<br>\
·你圆满完成了史上最糟糕约会。<br>\
·你的光头脑袋，哦，是的！有时候我盯着它想象着会有个小鸡蹦出来。<br>\
·我知道有人能改变你！ <br>\
·格鲁重出江湖，还会用上厉害的车和武器。<br>\
<br>\
<br>\
4、异形：契约<br>\
<br>\
·You sacrificed a lot for the mission.<br>\
·各位为了殖民任务，都牺牲了很多。<br>\
·People on earth are grateful to you, hard work, and extraordinary courage.<br>\
·地球上的人们都很感激你们，辛苦的劳作，与过人的胆识。<br>\
·We make history here.<br>\
.我们在这里创造历史<br>\
<br>\
<br>\
5、嫌疑人X的献身<br>\
<br>\
·这个世上没有无用的齿轮，也只有齿轮本身能决定自己的用途。<br>\
·有时候，一个人只要好好活着，就足以拯救某个人。<br>\
·逻辑的尽头,不是理性与秩序的理想国,而是我用生命奉献的爱情。<br>\
·有些真相注定是要小心翼翼深埋心底的，因为答案揭晓的那一刻，也是灰飞烟灭的开始。<br>\
·人一旦摆脱了时钟反而会把日子过得跟时钟一样准确。<br>\
·看起来是几何问题，实际上是函数问题。<br>\
<br>\
<br>\
6、神奇女侠<br>\
<br>\
·重要的不是值不值得，而是你相不相信。<br>\
·人人都有属于自己的战争，最要不得的就是放下武器缴械投降。<br>\
·我去拯救今天，你去拯救世界。<br>\
·戴安娜，你要公平的战斗，可战斗恰恰从不公平。<br>\
·你曾经是我的挚爱，戴安娜，但是现在你是我最深的痛。<br>\
·我的父亲曾经告诉过我，当这个世界发生了改变，要么别插手，要么改变它。<br>\
<br>\
<br>\
7、速度与激情8<br>\
<br>\
·没有什么是必要的，一切都只是选择。<br>\
·既然你踩到了老虎脖子上那你最好不要收脚。<br>\
·人不管在什么时候都不要放弃自己的家人，感谢你们从来没有放弃过我。<br>\
·我不知道你为什么这样做，但我知道一件事，你爱我。<br>\
·知道车里装着什么并不重要，重要的是谁来掌握方向盘。<br>\
<br>\
<br>\
8、加勒比海盗5<br>\
<br>\
·闭上眼，当做一切都是梦，我就是这么活过来的<br>\
·这世界上只有，什么事不能做，什么事可以做。<br>\
·因为地平线一直在那。你想到达那儿，但你永远到达不了，就是这样，遥不可及难以放弃。<br>\
·生命的意义远不止是生存，真正的技巧在于学会永远靠自己生活。<br>\
·当然要迷失方向，才能到达一个无人能找到的地方。<br>\
<br>\
<br>\
9、冈仁波齐<br>\
<br>\
·一群人在朝圣路上的一切：存活与信仰、降生与死亡。<br>\
·一群人决定去朝圣，带着各自的罪孽和希望。<br>\
·一群人的故事，它是一代藏民的一段生活。<br>\
·一群人的信仰，一群人的远方。<br>\
<br>\
<br>\
10、银河护卫队2<br>\
<br>\
·生活总是索取大于给予。<br>\
·因为自己的仇恨而连累别人的人不值得同情。<br>\
·其实，往往我们穷尽一生去寻找的，可能就在身边，比如爱情。 <br>\
·我们是格鲁特。<br>\
·你是我们最后的希望。<br>\
<br>\
<br>\
11、一条狗的使命<br>\
<br>\
·人类真复杂，为什么总是要做连狗都不明白的事，比如：离开。<br>\
·孤独将会是人生中遇到的最大的困难。<br>\
·若我能将幸福带给你，我就完成了自己的使命。<br>\
·每一个孤独的灵魂都需要陪伴。<br>\
<br>\
<br>\
12、金刚狼3<br>\
<br>\
·成为你想成为的，别成为他们所希望的。<br>\
·我不是你想象中的那个我。<br>\
·原来死亡是这种感觉。<br>\
·这就是人生本来的面貌，人们相亲相爱，有温暖的家，罗根，你应该静下来，用心感受，你还有时间。<br>\
·这个角色不会离开，是我生命的一部分。<br>\
<br>\
<br>\
13、美女与野兽<br>\
<br>\
·情，能把一个男人变成野兽;也可以让一个丑陋的人变得高尚。<br>\
·你是绅士。纵然你外貌丑陋，全身长满兽毛，你对我是温柔的。可是你无论多么温柔仍然是野兽!<br>\
·想象你梦寐以求的东西，在你的脑海中呈现它，用心去感受它。<br>\
·真正的美源自内心而非外表。<br>\
·我在寻找一个承诺，不问答案。<br>\
<br>\
<br>\
14、生化危机：终章<br>\
<br>\
·人们说历史是由胜利者书写的。<br>\
·十年前我们都失败了，现在让我们来终结这一切。<br>\
·有时候，克隆人比人类更有人性。<br>\
·Since the moment we join BSAA, never want to live on the back.<br>\
·My name is Alice, and this is my story, the end of my story.<br>\
·Since the moment we join BSAA, never want to live on the back.<br>\
<br>\
<br>\
15、爱乐之城<br>\
<br>\
·I am letting life hit me until it gets tired. Then Ill hit back. It is a classic rope-a-dope.<br>\
·我让生活一直打击我，直到它打不动。然后我会反击。这就是典型的以逸待劳。<br>\
·This is the dream! It is conflict and its compromise, and it is very, very exciting!<br>\
·梦想就是这样!有冲突，也有妥协，而且非常非常刺激!<br>\
';
var d=dataStr.split('<br><br><br>');
for (var i=0;i<d.length;i++){

    var c=d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、',' ')+'.jpg',
        caption:c[0].split('、')[1],
        desc:c[1]
    });
    // console.log(data[i].caption);
}
